Basic commands with for interfacing with =exwm= with =helm=

#+BEGIN_SRC emacs-lisp :tangle no
(with-eval-after-load 'helm
  ;; Need `with-eval-after-load' here since 'helm-map is not defined in 'helm-config.
  ;;  (ambrevar/define-keys helm-map "s-\\" 'helm-toggle-resplit-and-swap-windows) ;; already used in starter-kit-exwm.org for ambrevar/toggle-window-split
  ;; (exwm-input-set-key (kbd "s-c") #'helm-resume)  ;; get the latest helm thing you did!, i.e., reopen the last helm search. Hey: if I enable this line, instead of helm-resume I get helm-occur. Why?
  ;; (exwm-input-set-key (kbd "s-b") #'helm-mini) ;; not needed as already in =C-x b=
  ;; (exwm-input-set-key (kbd "s-f") #'helm-find-files) ;; already in C-x C-f
  ;; (exwm-input-set-key (kbd "s-:") #'helm-for-files) ;; tuhdo doesn't use it, so it goes
  (exwm-input-set-key (kbd "s-D") #'helm-locate)
  (exwm-input-set-key (kbd "s-d") #'helm-find))
  ;;(when (fboundp 'ambrevar/helm-locate-meta)
  ;;  (exwm-input-set-key (kbd "!!here") #'ambrevar/helm-locate-meta))
  ;; (exwm-input-set-key (kbd "s-F") #'helm-ag)
  ;; (exwm-input-set-key (kbd "s-f") #'helm-do-grep-ag))
  ;;(exwm-input-set-key (kbd "s-g") 'ambrevar/helm-grep-git-or-ag)
  ;;(exwm-input-set-key (kbd "s-G") 'ambrevar/helm-grep-git-all-or-ag))
#+END_SRC


* Quit Helm with one key stroke

Often when invoking helm and wanting to cancel, I have to press =C-g= multiple times. Trying here to reduce it to one time.

From: https://www.reddit.com/r/emacs/comments/7eboyr/closing_helmmx_with_single_key_press/

Originally i had also =(define-key helm-M-x-map (kbd "ESC") 'helm-keyboard-quit)= but then I got the message "(void-variable helm-M-x-map)" and could not use Helm.


#+BEGIN_SRC emacs-lisp :tangle no
(add-hook 'helm-after-initialize-hook
          (lambda()
            (define-key helm-buffer-map (kbd "C-g") 'helm-keyboard-quit)
            (define-key helm-map (kbd "C-g") 'helm-keyboard-quit)))
#+END_SRC

#+RESULTS:
| (lambda nil (define-key helm-buffer-map (kbd C-g) 'helm-keyboard-quit) (define-key helm-map (kbd C-g) 'helm-keyboard-quit)) | (lambda nil (define-key helm-buffer-map (kbd ESC) 'helm-keyboard-quit) (define-key helm-map (kbd ESC) 'helm-keyboard-quit)) | helm-reset-yank-point |

** Customization

https://github.com/emacs-helm/helm/wiki/Grep

#+begin_src emacs-lisp :tangle no
(setq helm-grep-ag-command "ag --line-numbers -S --hidden --color --color-match '31;43' --nogroup %s %s %s")
(setq helm-grep-ag-pipe-cmd-switches '("--color-match '31;43'"))
#+end_src

#+RESULTS:
| --color-match '31;43' |


** COMMENT =helm-ack=

=C-x C-f= you start a =helm-find-files= session. There you can do =C-s= to recursively grep a selected directory.  Every time you type a character, helm updates grep result immediately. You can use ack-grep to replace grep with this configuration:

DGM, 4 sept 2019: not sure ack is better than grep.

#+begin_src emacs-lisp :tangle no
(use-package helm-ack
  :config 
  (when (executable-find "ack-grep")
    (setq helm-grep-default-command "ack-grep -Hn --no-group --no-color %e %p %f"
          helm-grep-default-recurse-command "ack-grep -H --no-group --no-color %e %p %f")))
#+end_src

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (24463 12502 133331 166000) :init (24463 12502 133312 827000) :init-secs (0 0 41 20000) :use-package-secs (0 0 114 969000)))

*** Customization
https://github.com/emacs-helm/helm/wiki/Grep

#+begin_src emacs-lisp :tangle no
(setq helm-grep-default-command
      "grep --color=always -d skip %e -n%cH -e %p %f"
      helm-grep-default-recurse-command
      "grep --color=always -d recurse %e -n%cH -e %p %f")
#+end_src

#+RESULTS:
: grep --color=always -d recurse %e -n%cH -e %p %f

* helm-man-woman

With helm-man-woman, you can quickly jump to any man entry using the Helm interface, either by typing in Helm prompt or if the point is on a symbol, opening the man page at point. To enable man page at point, add the following code: 

#+begin_src emacs-lisp :tangle no
(add-to-list 'helm-sources-using-default-as-input 'helm-source-man-pages)
(global-set-key (kbd "s-m") 'helm-man-woman)
#+end_src

#+RESULTS:
| helm-source-imenu | helm-source-imenu-all | helm-source-info-elisp | helm-source-etags-select | helm-source-man-pages | helm-source-occur | helm-source-moccur | helm-source-grep-ag | helm-source-grep-git | helm-source-grep |

** Various =helm-projectile= shortcuts

#+begin_src emacs-lisp :tangle no
;; (define-key projectile-mode-map [?\s-d] 'projectile-switch-project)
(define-key projectile-mode-map [?\s-\|] 'helm-projectile-find-file-dwim)
(define-key projectile-mode-map [?\s-\`] 'helm-projectile-find-other-file)
(define-key projectile-mode-map [?\s-\*] 'helm-projectile-find-dir)
(define-key projectile-mode-map [?\s-j] 'helm-projectile-find-file)
(define-key projectile-mode-map [?\s-n] 'helm-projectile-switch-to-buffer)
;;(define-key projectile-mode-map [?\s-y] 'projectile-ag) ;; this is not working. 
#+end_src

#+RESULTS:
: helm-projectile-switch-to-buffer

;; (define-key projectile-mode-map [?\s-u] 'helm-projectile-find-file-in-known-projects) 
;(setq projectile-switch-project-action 'helm-projectile)
;(global-set-key (kbd "s-h") 'helm-projectile)
;; from https://projectile.readthedocs.io/en/latest/usage/
;; You can go one step further and set a list of folders which Projectile is automatically going to check for projects. But in reality, if I re-start the computer, Projectile does not recall this list. 
#+END_SRC

#+RESULTS: helm-projectile
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (24468 17416 676966 405000) :use-package-secs (0 0 778 197000) :init (24468 17416 676875 158000) :config (24468 17416 676862 517000) :config-secs (0 0 293 862000) :init-secs (0 0 588 488000)))

#+RESULTS: projectile
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (24467 60600 569116 147000) :init (24467 60600 568515 643000) :config (24467 60600 568480 166000) :config-secs (0 4 900998 288000) :init-secs (0 4 901050 52000) :use-package-secs (0 4 901695 797000)))

Need to use =helm-projectile-find-other-file=. See https://tuhdo.github.io/helm-projectile.html

#+BEGIN_SRC emacs-lisp :tangle no
(setq projectile-other-file-alist '(("cpp" "h" "hpp" "ipp")
                                    ("ipp" "h" "hpp" "cpp")
                                    ("hpp" "h" "ipp" "cpp")
                                    ("cxx" "hxx" "ixx")
                                    ("ixx" "cxx" "hxx")
                                    ("hxx" "ixx" "cxx")
                                    ("c" "h")
                                    ("m" "h")
                                    ("mm" "h")
                                    ("h" "c" "cpp" "ipp" "hpp" "m" "mm")
                                    ("cc" "hh")
                                    ("hh" "cc")
                                    ("vert" "frag")
                                    ("frag" "vert")
                                    (nil "lock" "gpg")
                                    ("lock" "")
                                    ("gpg" "")))

(add-to-list 'projectile-other-file-alist '("org" "el")) ;; switch from org -> el 
(add-to-list 'projectile-other-file-alist '("el" "org")) ;; switch from el -> org 
(add-to-list 'projectile-other-file-alist '("Rnw" "R"))
(add-to-list 'projectile-other-file-alist '("R" "Rnw"))
(add-to-list 'projectile-other-file-alist '("Rnw" "tex"))
(add-to-list 'projectile-other-file-alist '("tex" "Rnw"))
(add-to-list 'projectile-other-file-alist '("org" "tex"))
(add-to-list 'projectile-other-file-alist '("tex" "org"))
(add-to-list 'projectile-other-file-alist '("tex" "log"))
(add-to-list 'projectile-other-file-alist '("log" "tex"))
(add-to-list 'projectile-other-file-alist '("org" "html"))
(add-to-list 'projectile-other-file-alist '("html" "org"))
#+END_SRC

** Advice from Tuhdo for ignoring files

From https://github.com/bbatsov/projectile/issues/184

#+BEGIN_SRC emacs-lisp :tangle no
(add-to-list 'projectile-globally-ignored-files "*.png")
(setq projectile-globally-ignored-file-suffixes '(".cache"))
#+END_SRC

#+RESULTS:
| .cache |

* Limit candidates for speed

- Limit max number of matches displayed for speed. In Pragmatic Emacs's =helm-for-files= and in Sacha Chua's dotfiles.

#+BEGIN_SRC emacs-lisp :tangle no
(setq helm-candidate-number-limit 100)
#+END_SRC

#+RESULTS:
: 100

*** Tuhdo's set up

#+begin_src emacs-lisp :tangle no
(use-package projectile
   :init
  (projectile-global-mode)
  (setq projectile-enable-caching t))
#+end_src

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (24034 9694 517929 992000) :init (24034 9694 517918 228000) :config (24034 9694 517634 638000) :config-secs (0 0 9 408000) :init-secs (0 5 707366 238000) :use-package-secs (0 5 707478 796000)))


